#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.acm_certificate_proyecto.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:414131675413:certificate/d958aba8-d6d8-47e8-91df-74ab08b9d104]
data.aws_route53_zone.zone: Reading...
aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E28Z2QXEA2C7VT]
aws_s3_bucket.website_bucket: Refreshing state... [id=proyecto-docs]
data.aws_route53_zone.zone: Read complete after 0s [id=Z05147491T2U914Y84HJY]
module.acm_certificate_proyecto.aws_route53_record.validation[0]: Refreshing state... [id=Z05147491T2U914Y84HJY__6a5ed819a889f205bc12336a926abb66.proyecto-docs.data.pre.basetis.com._CNAME]
module.acm_certificate_proyecto.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2025-05-22 13:54:00.001 +0000 UTC]
aws_s3_bucket_public_access_block.website_bucket: Refreshing state... [id=proyecto-docs]
aws_s3_bucket_ownership_controls.website_bucket: Refreshing state... [id=proyecto-docs]
aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=proyecto-docs]
aws_cloudfront_distribution.website_distribution: Refreshing state... [id=EYUOBKK6C8B5Y]
aws_s3_bucket_acl.website_bucket: Refreshing state... [id=proyecto-docs,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "proyecto-docs.data.pre.basetis.com"
      + type            = "A"
      + zone_id         = "Z05147491T2U914Y84HJY"

      + alias {
          + evaluate_target_health = false
          + name                   = "d22rj6k80xr6t8.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + route53_alias_record                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @AlvaroGarOca, Action: `pull_request`*